Revit 2026 API
FamilyManager.SortParameters Method
 Sorts the family parameters according to the desired sort order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SortParameters(
	ParametersOrder order
)
Public Sub SortParameters (
	order As ParametersOrder
)
public:
void SortParameters(
	ParametersOrder order
)
member SortParameters :
        order : ParametersOrder -> unit
Parameters
order ParametersOrder
 The desired sort order.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this family is a Rebar Shape family which doesn't support parameters reorder.
Remarks
The sort only affects visible parameters within the same parameter group.
Parameters that belong to different groups will remain separated, and the groups' order will not be affected.
The sort is a one-time operation and when new parameters are added they will not be automatically sorted.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace